In [21]:
import pandas as pd

In [22]:
orders = pd.read_table('http://bit.ly/chiporders')

In [23]:
orders.head()

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98

In [24]:
pd.read_table('http://bit.ly/movieusers',sep='|',header=None)

       0   1  2              3      4
0      1  24  M     technician  85711
1      2  53  F          other  94043
2      3  23  M         writer  32067
3      4  24  M     technician  43537
4      5  33  F          other  15213
..   ...  .. ..            ...    ...
938  939  26  F        student  33319
939  940  32  M  administrator  02215
940  941  20  M        student  97229
941  942  48  F      librarian  78209
942  943  22  M        student  77841

[943 rows x 5 columns]

In [25]:
mov_col = ['user_id','age','gender','occ','zip']

In [26]:
mov_col

['user_id', 'age', 'gender', 'occ', 'zip']

In [27]:
 users = pd.read_table('http://bit.ly/movieusers',sep='|',header=None,names = mov_col)

In [28]:
users.head()

   user_id  age gender         occ    zip
0        1   24      M  technician  85711
1        2   53      F       other  94043
2        3   23      M      writer  32067
3        4   24      M  technician  43537
4        5   33      F       other  15213

In [29]:
users

     user_id  age gender            occ    zip
0          1   24      M     technician  85711
1          2   53      F          other  94043
2          3   23      M         writer  32067
3          4   24      M     technician  43537
4          5   33      F          other  15213
..       ...  ...    ...            ...    ...
938      939   26      F        student  33319
939      940   32      M  administrator  02215
940      941   20      M        student  97229
941      942   48      F      librarian  78209
942      943   22      M        student  77841

[943 rows x 5 columns]

In [30]:
ufo = pd.read_table('http://bit.ly/uforeports',sep=',')
ufo
type(ufo)

pandas.core.frame.DataFrame

In [31]:
ufo.head()

                   City Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

In [32]:
ufo['City']

0                      Ithaca
1                 Willingboro
2                     Holyoke
3                     Abilene
4        New York Worlds Fair
                 ...
18236              Grant Park
18237             Spirit Lake
18238             Eagle River
18239             Eagle River
18240                    Ybor
Name: City, Length: 18241, dtype: object

In [33]:
type(ufo['City'])

pandas.core.series.Series

In [34]:
ufo.City

0                      Ithaca
1                 Willingboro
2                     Holyoke
3                     Abilene
4        New York Worlds Fair
                 ...
18236              Grant Park
18237             Spirit Lake
18238             Eagle River
18239             Eagle River
18240                    Ybor
Name: City, Length: 18241, dtype: object

In [35]:
ufo['Shape Reported']

0        TRIANGLE
1           OTHER
2            OVAL
3            DISK
4           LIGHT
           ...
18236    TRIANGLE
18237        DISK
18238         NaN
18239       LIGHT
18240        OVAL
Name: Shape Reported, Length: 18241, dtype: object

In [36]:
ufo.shape

(18241, 5)

In [37]:
ufo['Location'] =  ufo.City + '-' + ufo.State

In [38]:
ufo.head()

,City,Colors Reported,Shape Reported,State,Time,Location
0,Ithaca,NaN,TRIANGLE,NY,6/1/1930 22:00,Ithaca-NY
1,Willingboro,NaN,OTHER,NJ,6/30/1930 20:00,Willingboro-NJ
2,Holyoke,NaN,OVAL,CO,2/15/1931 14:00,Holyoke-CO
3,Abilene,NaN,DISK,KS,6/1/1931 13:00,Abilene-KS
4,New York Worlds Fair,NaN,LIGHT,NY,4/18/1933 19:00,New York Worlds Fair-NY

In [39]:
movies = pd.read_csv('http://bit.ly/imdbratings')

In [40]:
movies

,star_rating,title,content_rating,genre,duration,actors_list
0,9.3,The Shawshank Redemption,R,Crime,142,"[u'Tim Robbins', u'Morgan Freeman', u'Bob Gunt..."
1,9.2,The Godfather,R,Crime,175,"[u'Marlon Brando', u'Al Pacino', u'James Caan']"
2,9.1,The Godfather: Part II,R,Crime,200,"[u'Al Pacino', u'Robert De Niro', u'Robert Duv..."
3,9.0,The Dark Knight,PG-13,Action,152,"[u'Christian Bale', u'Heath Ledger', u'Aaron E..."
4,8.9,Pulp Fiction,R,Crime,154,"[u'John Travolta', u'Uma Thurman', u'Samuel L...."
...,...,...,...,...,...,...
974,7.4,Tootsie,PG,Comedy,116,"[u'Dustin Hoffman', u'Jessica Lange', u'Teri G..."
975,7.4,Back to the Future Part III,PG,Adventure,118,"[u'Michael J. Fox', u'Christopher Lloyd', u'Ma..."
976,7.4,Master and Commander: The Far Side of the World,PG-13,Action,138,"[u'Russell Crowe', u'Paul Bettany', u'Billy Bo..."
977,7.4,Poltergeist,PG,Horror,114,"[u'JoBeth Williams', u""Heather O'Rourke"", u'Cr..."
978,7.4,Wall Street,R,Crime,126,"[u'Charlie Sheen', u'Michael Douglas', u'Tamar..."

In [41]:
movies.describe()

       star_rating    duration
count   979.000000  979.000000
mean      7.889785  120.979571
std       0.336069   26.218010
min       7.400000   64.000000
25%       7.600000  102.000000
50%       7.800000  117.000000
75%       8.100000  134.000000
max       9.300000  242.000000

In [42]:
movies.shape

(979, 6)

In [43]:
movies.dtypes

star_rating       float64
title              object
content_rating     object
genre              object
duration            int64
actors_list        object
dtype: object

In [44]:
type(movies)

pandas.core.frame.DataFrame

In [45]:
movies.describe(include=['float64'])

       star_rating
count   979.000000
mean      7.889785
std       0.336069
min       7.400000
25%       7.600000
50%       7.800000
75%       8.100000
max       9.300000

In [46]:
ufo

,City,Colors Reported,Shape Reported,State,Time,Location
0,Ithaca,NaN,TRIANGLE,NY,6/1/1930 22:00,Ithaca-NY
1,Willingboro,NaN,OTHER,NJ,6/30/1930 20:00,Willingboro-NJ
2,Holyoke,NaN,OVAL,CO,2/15/1931 14:00,Holyoke-CO
3,Abilene,NaN,DISK,KS,6/1/1931 13:00,Abilene-KS
4,New York Worlds Fair,NaN,LIGHT,NY,4/18/1933 19:00,New York Worlds Fair-NY
...,...,...,...,...,...,...
18236,Grant Park,NaN,TRIANGLE,IL,12/31/2000 23:00,Grant Park-IL
18237,Spirit Lake,NaN,DISK,IA,12/31/2000 23:00,Spirit Lake-IA
18238,Eagle River,NaN,NaN,WI,12/31/2000 23:45,Eagle River-WI
18239,Eagle River,RED,LIGHT,WI,12/31/2000 23:45,Eagle River-WI
18240,Ybor,NaN,OVAL,FL,12/31/2000 23:59,Ybor-FL

In [47]:
ufo.columns

Index(['City', 'Colors Reported', 'Shape Reported', 'State', 'Time',
       'Location'],
      dtype='object')

In [48]:
ufo = ufo.rename(columns = {'Colors Reported': 'ColorsReported','Shape Reported':'ShapeRepoerted'})

In [49]:
ufo.columns

Index(['City', 'ColorsReported', 'ShapeRepoerted', 'State', 'Time',
       'Location'],
      dtype='object')

In [50]:
ufo_cols = ['city','colorsreported','shapereported','state','time','location']
ufo.columns = ufo_cols

In [51]:
ufo.columns

Index(['city', 'colorsreported', 'shapereported', 'state', 'time', 'location'], dtype='object')

In [52]:
ufo.head()

,city,colorsreported,shapereported,state,time,location
0,Ithaca,NaN,TRIANGLE,NY,6/1/1930 22:00,Ithaca-NY
1,Willingboro,NaN,OTHER,NJ,6/30/1930 20:00,Willingboro-NJ
2,Holyoke,NaN,OVAL,CO,2/15/1931 14:00,Holyoke-CO
3,Abilene,NaN,DISK,KS,6/1/1931 13:00,Abilene-KS
4,New York Worlds Fair,NaN,LIGHT,NY,4/18/1933 19:00,New York Worlds Fair-NY

In [53]:
movies

,star_rating,title,content_rating,genre,duration,actors_list
0,9.3,The Shawshank Redemption,R,Crime,142,"[u'Tim Robbins', u'Morgan Freeman', u'Bob Gunt..."
1,9.2,The Godfather,R,Crime,175,"[u'Marlon Brando', u'Al Pacino', u'James Caan']"
2,9.1,The Godfather: Part II,R,Crime,200,"[u'Al Pacino', u'Robert De Niro', u'Robert Duv..."
3,9.0,The Dark Knight,PG-13,Action,152,"[u'Christian Bale', u'Heath Ledger', u'Aaron E..."
4,8.9,Pulp Fiction,R,Crime,154,"[u'John Travolta', u'Uma Thurman', u'Samuel L...."
...,...,...,...,...,...,...
974,7.4,Tootsie,PG,Comedy,116,"[u'Dustin Hoffman', u'Jessica Lange', u'Teri G..."
975,7.4,Back to the Future Part III,PG,Adventure,118,"[u'Michael J. Fox', u'Christopher Lloyd', u'Ma..."
976,7.4,Master and Commander: The Far Side of the World,PG-13,Action,138,"[u'Russell Crowe', u'Paul Bettany', u'Billy Bo..."
977,7.4,Poltergeist,PG,Horror,114,"[u'JoBeth Williams', u""Heather O'Rourke"", u'Cr..."
978,7.4,Wall Street,R,Crime,126,"[u'Charlie Sheen', u'Michael Douglas', u'Tamar..."

In [54]:
ufo

,city,colorsreported,shapereported,state,time,location
0,Ithaca,NaN,TRIANGLE,NY,6/1/1930 22:00,Ithaca-NY
1,Willingboro,NaN,OTHER,NJ,6/30/1930 20:00,Willingboro-NJ
2,Holyoke,NaN,OVAL,CO,2/15/1931 14:00,Holyoke-CO
3,Abilene,NaN,DISK,KS,6/1/1931 13:00,Abilene-KS
4,New York Worlds Fair,NaN,LIGHT,NY,4/18/1933 19:00,New York Worlds Fair-NY
...,...,...,...,...,...,...
18236,Grant Park,NaN,TRIANGLE,IL,12/31/2000 23:00,Grant Park-IL
18237,Spirit Lake,NaN,DISK,IA,12/31/2000 23:00,Spirit Lake-IA
18238,Eagle River,NaN,NaN,WI,12/31/2000 23:45,Eagle River-WI
18239,Eagle River,RED,LIGHT,WI,12/31/2000 23:45,Eagle River-WI
18240,Ybor,NaN,OVAL,FL,12/31/2000 23:59,Ybor-FL

In [55]:
ufo.drop(['state','location'],axis=1,inplace=True)

In [56]:
ufo.head()

                   city colorsreported shapereported             time
0                Ithaca            NaN      TRIANGLE   6/1/1930 22:00
1           Willingboro            NaN         OTHER  6/30/1930 20:00
2               Holyoke            NaN          OVAL  2/15/1931 14:00
3               Abilene            NaN          DISK   6/1/1931 13:00
4  New York Worlds Fair            NaN         LIGHT  4/18/1933 19:00

In [57]:
ufo.drop([101,250],axis=0,inplace=True)

In [58]:
ufo

                       city colorsreported shapereported              time
0                    Ithaca            NaN      TRIANGLE    6/1/1930 22:00
1               Willingboro            NaN         OTHER   6/30/1930 20:00
2                   Holyoke            NaN          OVAL   2/15/1931 14:00
3                   Abilene            NaN          DISK    6/1/1931 13:00
4      New York Worlds Fair            NaN         LIGHT   4/18/1933 19:00
...                     ...            ...           ...               ...
18236            Grant Park            NaN      TRIANGLE  12/31/2000 23:00
18237           Spirit Lake            NaN          DISK  12/31/2000 23:00
18238           Eagle River            NaN           NaN  12/31/2000 23:45
18239           Eagle River            RED         LIGHT  12/31/2000 23:45
18240                  Ybor            NaN          OVAL  12/31/2000 23:59

[18239 rows x 4 columns]

In [59]:
ufo

                       city colorsreported shapereported              time
0                    Ithaca            NaN      TRIANGLE    6/1/1930 22:00
1               Willingboro            NaN         OTHER   6/30/1930 20:00
2                   Holyoke            NaN          OVAL   2/15/1931 14:00
3                   Abilene            NaN          DISK    6/1/1931 13:00
4      New York Worlds Fair            NaN         LIGHT   4/18/1933 19:00
...                     ...            ...           ...               ...
18236            Grant Park            NaN      TRIANGLE  12/31/2000 23:00
18237           Spirit Lake            NaN          DISK  12/31/2000 23:00
18238           Eagle River            NaN           NaN  12/31/2000 23:45
18239           Eagle River            RED         LIGHT  12/31/2000 23:45
18240                  Ybor            NaN          OVAL  12/31/2000 23:59

[18239 rows x 4 columns]

In [60]:
movies

,star_rating,title,content_rating,genre,duration,actors_list
0,9.3,The Shawshank Redemption,R,Crime,142,"[u'Tim Robbins', u'Morgan Freeman', u'Bob Gunt..."
1,9.2,The Godfather,R,Crime,175,"[u'Marlon Brando', u'Al Pacino', u'James Caan']"
2,9.1,The Godfather: Part II,R,Crime,200,"[u'Al Pacino', u'Robert De Niro', u'Robert Duv..."
3,9.0,The Dark Knight,PG-13,Action,152,"[u'Christian Bale', u'Heath Ledger', u'Aaron E..."
4,8.9,Pulp Fiction,R,Crime,154,"[u'John Travolta', u'Uma Thurman', u'Samuel L...."
...,...,...,...,...,...,...
974,7.4,Tootsie,PG,Comedy,116,"[u'Dustin Hoffman', u'Jessica Lange', u'Teri G..."
975,7.4,Back to the Future Part III,PG,Adventure,118,"[u'Michael J. Fox', u'Christopher Lloyd', u'Ma..."
976,7.4,Master and Commander: The Far Side of the World,PG-13,Action,138,"[u'Russell Crowe', u'Paul Bettany', u'Billy Bo..."
977,7.4,Poltergeist,PG,Horror,114,"[u'JoBeth Williams', u""Heather O'Rourke"", u'Cr..."
978,7.4,Wall Street,R,Crime,126,"[u'Charlie Sheen', u'Michael Douglas', u'Tamar..."

In [61]:
movies.head(100)

,star_rating,title,content_rating,genre,duration,actors_list
0,9.3,The Shawshank Redemption,R,Crime,142,"[u'Tim Robbins', u'Morgan Freeman', u'Bob Gunt..."
1,9.2,The Godfather,R,Crime,175,"[u'Marlon Brando', u'Al Pacino', u'James Caan']"
2,9.1,The Godfather: Part II,R,Crime,200,"[u'Al Pacino', u'Robert De Niro', u'Robert Duv..."
3,9.0,The Dark Knight,PG-13,Action,152,"[u'Christian Bale', u'Heath Ledger', u'Aaron E..."
4,8.9,Pulp Fiction,R,Crime,154,"[u'John Travolta', u'Uma Thurman', u'Samuel L...."
...,...,...,...,...,...,...
95,8.4,All About Eve,APPROVED,Drama,138,"[u'Bette Davis', u'Anne Baxter', u'George Sand..."
96,8.4,Yojimbo,UNRATED,Action,110,"[u'Toshir\xf4 Mifune', u'Eijir\xf4 T\xf4no', u..."
97,8.4,The Sting,PG,Comedy,129,"[u'Paul Newman', u'Robert Redford', u'Robert S..."
98,8.4,Rashomon,UNRATED,Crime,88,"[u'Toshir\xf4 Mifune', u'Machiko Ky\xf4', u'Ma..."
99,8.4,Amadeus,R,Biography,160,"[u'F. Murray Abraham', u'Tom Hulce', u'Elizabe..."

In [62]:
movies = movies.title.sort_values()

In [63]:
movies

542     (500) Days of Summer
5               12 Angry Men
201         12 Years a Slave
698                127 Hours
110    2001: A Space Odyssey
               ...
955         Zero Dark Thirty
677                   Zodiac
615               Zombieland
526                     Zulu
864                    [Rec]
Name: title, Length: 979, dtype: object

In [64]:
movies

542     (500) Days of Summer
5               12 Angry Men
201         12 Years a Slave
698                127 Hours
110    2001: A Space Odyssey
               ...
955         Zero Dark Thirty
677                   Zodiac
615               Zombieland
526                     Zulu
864                    [Rec]
Name: title, Length: 979, dtype: object

In [65]:
movies.title.sort_values(ascending=False)

AttributeError: 'Series' object has no attribute 'title'

In [ ]:
movies.sort_values(['title','duration'])

In [ ]:
movies.sort('duration')

In [ ]:
movies

In [ ]:
islong = movies.duration >= 200

In [ ]:
islong

In [ ]:
movies[movies.duration >= 200]

In [ ]:
movies

In [ ]:
movies.loc[movies.duration >= 200,'title']

In [ ]:
movies

In [ ]:
movies[(movies.duration >= 200) & (movies.genre == 'Drama')]

In [ ]:
movies[movies.genre.isin(['Crime','Drama','Action'])]

In [ ]:
import pandas as pd

In [ ]:
train = pd.read_csv('http://bit.ly/kaggletrain')

In [ ]:
train

In [ ]:
train['Sex_male'] = train.Sex.map({'female':0,'male':1})

In [ ]:
train

In [ ]:
pd.get_dummies(train.Sex,prefix='Sex').iloc[:,1:]

In [ ]:
train.Embarked.value_counts()

In [ ]:
embarked_dummies = pd.get_dummies(train.Embarked,prefix='Embarked').iloc[:,1:]

In [ ]:
train =pd.concat([train,embarked_dummies],axis=1)

In [ ]:
train

In [ ]:
pd.get_dummies(train,columns=['Sex','Embarked'],drop_first=True)

In [ ]:
ufo = pd.read_csv('http://bit.ly/uforeports')

In [ ]:
ufo

In [ ]:
ufo.dtypes

In [ ]:
ufo['Time'] = pd.to_datetime(ufo.Time)

In [ ]:
ufo.dtypes

In [ ]:
ufo.Time.dt.hour

In [ ]:
ufo.Time.dt.week

In [ ]:
pd.to_datetime('1/1/1999')

In [ ]:
ufo.loc[ufo.Time>=Timestamp,:]

In [ ]:
ufo.Time.min()

In [ ]:
%matplotlib inline

In [ ]:
ufo['Year'] = ufo.Time.dt.year

In [ ]:
ufo.Year.value_counts().sort_index().plot()

In [ ]:
user_cols =['user_id','age','gender','occupation','zip_code']
users =pd.read_table('http://bit.ly/movieusers',sep='|',header=None,names = user_cols,index_col='user_id')

In [ ]:
users

In [ ]:
users.shape

In [ ]:
users.zip_code.duplicated()

In [ ]:
users.duplicated().sum()

In [ ]:
users.drop_duplicates(keep=False).shape

In [ ]:
users.drop_duplicates(subset=['age','zip_code']).shape

In [ ]:
movies

In [ ]:
movies =pd.read_csv('http://bit.ly/imdbratings')

In [ ]:
movies

In [ ]:
movies[movies.content_rating.isnull()]

In [ ]:
movies.content_rating.value_counts()

In [ ]:
movies[movies.content_rating == 'NOT RATED'].content_rating = np.nan

In [ ]:
import numpy as np

In [ ]:
movies[movies.content_rating == 'NOT RATED'].content_rating = np.nan

In [ ]:
movies.content_rating.isnull().sum()

In [ ]:
movies.loc[movies.content_rating == 'NOT RATED','content_rating'] = np.nan

In [ ]:
top_movies =movies.loc[movies.star_rating >= 9 ,:]

In [ ]:
top_movies

In [ ]:
top_movies.loc[0,'duration'] = 155

In [ ]:
top_movies

In [ ]:
top_movies =movies.loc[movies.star_rating >= 9 ,:].copy()

In [ ]:
top_movies.loc[0,'duration'] = 155

In [ ]:
top_movies

In [ ]:
movies.head()

In [ ]:
print("hello")

In [ ]:
drinks = pd.read_csv('http://bit.ly/drinksbycountry')

In [ ]:
import pandas as pd

In [ ]:
drinks = pd.read_csv('http://bit.ly/drinksbycountry')

In [ ]:
drinks

In [ ]:
pd.get_option('display.max_rows')

In [ ]:
drinks

In [ ]:
train = pd.read_csv('http://bit.ly/kaggletrain')

In [ ]:
train

In [ ]:
pd.get_option('display.max_colwidth')

In [ ]:
train

In [ ]:
pd.set_option('display.precision',2)

In [ ]:
train

In [ ]:
drinks['x'] = drinks.wine_servings * 1000

In [ ]:
drinks

In [ ]:
drinks['y'] = drinks.total_litres_of_pure_alcohol * 1000

In [ ]:
drinks

In [ ]:
drinks[['x','y']].plot()

In [ ]:
pd.set_option('display.float_format','{:,}'.format)

In [ ]:
drinks

In [ ]:
pd.describe_option('rows')

In [ ]:
pd.reset_option('all')

In [ ]:
df = pd.DataFrame({'id':[100,101,102],'color':['red','blue','red']},columns=['id','color'],index=['a','b','c'])

In [ ]:
df

In [ ]:
pd.DataFrame([[100,'red'],[101,'blue'],[102,'red']],columns=['id','color'])

In [ ]:
import numpy as np

In [ ]:
arr = np.random.rand(10,12)
arr

In [ ]:
pd.DataFrame(arr)

In [ ]:
pd.DataFrame({'student':np.arange(100,110,1),'test':np.random.randint(60,101,10)})

In [ ]:
s = pd.Series(['round','square'],index=['c','b'],name='shape')
s

In [ ]:
df

In [ ]:
pd.concat([df,s],axis=1)

In [ ]:
train

In [ ]:
train['Sex_num'] = train.Sex.map({'female':0,'male':1})

In [ ]:
train

In [ ]:
train['Name_length'] = train.Name.apply(len)

In [ ]:
train

In [ ]:
train['Fare_ceil'] = train.Fare.apply(np.ceil)

In [ ]:
train

In [ ]:
train.Name.str.split(',').head()

In [ ]:
def get_ele(my_list,position):
    return my_list[position]

In [ ]:
train.Name.str.split(',').apply(lambda x:x[0]).head()

In [ ]:
drinks

In [ ]:
drinks.loc[:,'beer_servings':'wine_servings'].applymap(float)

In [ ]:
type(L = [1, 23, ‘hello’,1])

In [ ]:
 s1= {1, 2, 3} ? s1.issubset(s1)

In [ ]:
“hello”+1+2+3

In [ ]:
 '1,2,3,4'.split(',')

In [ ]:
t = (1, 2, 4, 3)

In [ ]:
print(t[3])

In [ ]:
t[3] = 45

In [ ]:
print(max(t))

In [ ]:
word = 'aeioubcdfg'
print(word[:3]+ word[3:])

In [ ]:
count = 1
def dothis():
    global count
    for i in (1,2,3):
        count += 1
dothis()
count

In [ ]:
df

In [ ]:
df

In [66]:
df

NameError: name 'df' is not defined

In [67]:
movies

542     (500) Days of Summer
5               12 Angry Men
201         12 Years a Slave
698                127 Hours
110    2001: A Space Odyssey
               ...
955         Zero Dark Thirty
677                   Zodiac
615               Zombieland
526                     Zulu
864                    [Rec]
Name: title, Length: 979, dtype: object

In [68]:
ufo

                       city colorsreported shapereported              time
0                    Ithaca            NaN      TRIANGLE    6/1/1930 22:00
1               Willingboro            NaN         OTHER   6/30/1930 20:00
2                   Holyoke            NaN          OVAL   2/15/1931 14:00
3                   Abilene            NaN          DISK    6/1/1931 13:00
4      New York Worlds Fair            NaN         LIGHT   4/18/1933 19:00
...                     ...            ...           ...               ...
18236            Grant Park            NaN      TRIANGLE  12/31/2000 23:00
18237           Spirit Lake            NaN          DISK  12/31/2000 23:00
18238           Eagle River            NaN           NaN  12/31/2000 23:45
18239           Eagle River            RED         LIGHT  12/31/2000 23:45
18240                  Ybor            NaN          OVAL  12/31/2000 23:59

[18239 rows x 4 columns]

In [72]:
ufo['city'].values

array(['Ithaca', 'Willingboro', 'Holyoke', ..., 'Eagle River',
       'Eagle River', 'Ybor'], dtype=object)

In [71]:
ufo['city'].values()

TypeError: 'numpy.ndarray' object is not callable

In [73]:
r = lambda q : q*2
s = lambda q: q*3
x=2
x = r(x)
x=s(x)
x=r(x)
x

24

In [74]:
x = ['ab','cd']
print(list(map(list,x)))

[['a', 'b'], ['c', 'd']]

In [75]:
abc = 100,000

In [76]:
abc

(100, 0)

In [77]:
a b c = 1000 2000 300

SyntaxError: invalid syntax (<ipython-input-77-aa4cd6b69f45>, line 1)